fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ВКМ_ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафика</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикиРаботы/ВКМ_ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРаботы</name>
  <resources>
    <name>РабочийДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, ГрафикРаботы) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.ГрафикРаботы.Установить(ГрафикРаботы);
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	Дат = НачалоДня(ДатаНачала);
	КонечнаяДата = НачалоДня(ДатаОкончания);
	
	ИндексОбхода = 0;
	Пока Дат <= КонечнаяДата Цикл
		
		ЗаписьНайдена = Ложь;

		Пока ИндексОбхода < Набор.Количество() Цикл
			Запись = Набор[ИндексОбхода];
			
			Если НачалоДня(Запись.Дата) < Дат Тогда
				ИндексОбхода = ИндексОбхода + 1;
				Продолжить;
			ИначеЕсли НачалоДня(Запись.Дата) = Дат Тогда
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					Запись.РабочийДень = 0;
				Иначе	          
					Запись.РабочийДень = 1; 
				КонецЕсли;
				ЗаписьНайдена = Истина;
				ИндексОбхода = ИндексОбхода + 1;
				Прервать;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если Не ЗаписьНайдена Тогда
			
			НоваяЗапись = Набор.Добавить();
			НоваяЗапись.ГрафикРаботы = ГрафикРаботы;
			НоваяЗапись.Дата = Дат;
			Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				НоваяЗапись.РабочийДень = 0;
			Иначе	          
				НоваяЗапись.РабочийДень = 1;
			КонецЕсли;
			
		КонецЕсли;
		
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
